## Analyse des villes de France
**Exercice 32** du cours Python Objet (PYT)

In [2]:
#importation des librairies
import pandas as pd
import os

In [5]:
#paramètres de l'application
chemin_fichier = "./Data/Villes_France"
fichier_departements = os.path.join(chemin_fichier, "departements.csv")
fichier_villes = os.path.join(chemin_fichier, "villes.csv")

In [18]:
# 1. Générez les dataframes `df_departements` et  `df_villes`
df_departements = pd.read_csv(fichier_departements)

df_departements.head()

,departement_id,departement_code,departement_nom,departement_nom_uppercase,departement_slug
0,1,01,Ain,AIN,ain
1,2,02,Aisne,AISNE,aisne
2,3,03,Allier,ALLIER,allier
3,5,05,Hautes-Alpes,HAUTES-ALPES,hautes-alpes
4,4,04,Alpes-de-Haute-Provence,ALPES-DE-HAUTE-PROVENCE,alpes-de-haute-provence

In [19]:
df_villes = pd.read_csv(fichier_villes, dtype={"ville_departement": "str", "ville_code_commune": "str"})

df_villes.head()

,ville_id,ville_departement,ville_nom,ville_nom_simple,ville_nom_reel,ville_code_postal,ville_commune,ville_code_commune,ville_population_2010,ville_population_1999,ville_population_2012,ville_surface,ville_longitude_deg,ville_latitude_deg,ville_longitude_dms,ville_latitude_dms,ville_zmin,ville_zmax
0,1,1,OZAN,ozan,Ozan,1190,284,1284,618,469,500,6.60,4.91667,46.3833,45456.0,462330.0,170.0,205.0
1,2,1,CORMORANCHE-SUR-SAONE,cormoranche sur saone,Cormoranche-sur-Saône,1290,123,1123,1058,903,1000,9.85,4.83333,46.2333,44953.0,461427.0,168.0,211.0
2,3,1,PLAGNE,plagne,Plagne,1130,298,1298,129,83,100,6.20,5.73333,46.1833,54342.0,461131.0,560.0,922.0
3,4,1,TOSSIAT,tossiat,Tossiat,1250,422,1422,1406,1111,1400,10.17,5.31667,46.1333,51854.0,460828.0,244.0,501.0
4,5,1,POUILLAT,pouillat,Pouillat,1250,309,1309,88,58,100,6.23,5.43333,46.3333,52542.0,461938.0,333.0,770.0

In [67]:
# 2. Affichez la liste des 10 villes les plus peuplées en 2012
df_villes_plus_peuplees = df_villes[["ville_nom", "ville_population_2012"]] \
.sort_values("ville_population_2012", ascending=False) \
.head(10)

df_villes_plus_peuplees

         ville_nom  ville_population_2012
30438        PARIS                2211000
4441     MARSEILLE                 851400
28156         LYON                 474900
11725     TOULOUSE                 439600
2051          NICE                 344900
16756       NANTES                 283300
27304   STRASBOURG                 272100
13344  MONTPELLIER                 253000
12684     BORDEAUX                 235900
22745        LILLE                 225800

In [69]:
df_villes_plus_peuplees["ville_nom"].to_list()

['PARIS',
 'MARSEILLE',
 'LYON',
 'TOULOUSE',
 'NICE',
 'NANTES',
 'STRASBOURG',
 'MONTPELLIER',
 'BORDEAUX',
 'LILLE']

In [70]:
# 3. Obtenez la liste des 10 villes ayant la plus faible superficie
df_faible_superficie = df_villes[["ville_nom", "ville_surface"]] \
.sort_values("ville_surface") \
.head(10)

df_faible_superficie

                   ville_nom  ville_surface
12992   CASTELMORON-D'ALBRET           0.04
7990        PLESSIX-BALISSON           0.08
36178            VAUDHERLAND           0.09
22779                 LANNOY           0.18
33907              MALLIEVRE           0.20
13111          SAINT-ANTOINE           0.20
10280  LA FERRIERE-SUR-RISLE           0.24
26695           SAINTE-MARIE           0.28
29496           BOURG-LE-ROI           0.36
27125             MONT-LOUIS           0.39

In [71]:
df_faible_superficie["ville_nom"].to_list()

["CASTELMORON-D'ALBRET",
 'PLESSIX-BALISSON',
 'VAUDHERLAND',
 'LANNOY',
 'MALLIEVRE',
 'SAINT-ANTOINE',
 'LA FERRIERE-SUR-RISLE',
 'SAINTE-MARIE',
 'BOURG-LE-ROI',
 'MONT-LOUIS']

In [72]:
# 4.Obtenez la liste des départements d’outres-mer (le département commence par "97")
df_departements_outres_mer = df_departements[df_departements["departement_code"].str.startswith("97")]
df_departements_outres_mer

,departement_id,departement_code,departement_nom,departement_nom_uppercase,departement_slug
96,97,976,Mayotte,MAYOTTE,mayotte
97,98,971,Guadeloupe,GUADELOUPE,guadeloupe
98,99,973,Guyane,GUYANE,guyane
99,100,972,Martinique,MARTINIQUE,martinique
100,101,974,Réunion,RÉUNION,reunion

In [73]:
df_departements_outres_mer["departement_nom"].to_list()

['Mayotte', 'Guadeloupe', 'Guyane', 'Martinique', 'Réunion']

In [91]:
# 5. Obtenez le nom des 10 villes les plus peuplées en 2012, ainsi que le nom du département associé.

df_villes_plus_peuplees = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="left") \
    .sort_values("ville_population_2012", ascending=False)[["ville_nom", "departement_nom", "ville_population_2012"]] \
    .head(10)
    
df_villes_plus_peuplees

         ville_nom   departement_nom  ville_population_2012
30438        PARIS             Paris                2211000
4441     MARSEILLE  Bouches-du-Rhône                 851400
28156         LYON             Rhône                 474900
11725     TOULOUSE     Haute-Garonne                 439600
2051          NICE               NaN                 344900
16756       NANTES  Loire-Atlantique                 283300
27304   STRASBOURG          Bas-Rhin                 272100
13344  MONTPELLIER           Hérault                 253000
12684     BORDEAUX           Gironde                 235900
22745        LILLE              Nord                 225800

In [98]:
# 6. Obtenez la liste du nom de chaque département, associé à son code et du nombre de communes au sein de ces départements
df_departements_nb_communes = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="inner") \
    .groupby("departement_nom") \
    .agg(nombre_communes=("ville_nom", "count")) \
    .sort_values("nombre_communes", ascending=False)

df_departements_nb_communes

                 nombre_communes
departement_nom
Pas-de-Calais                895
Somme                        782
Seine-Maritime               745
Moselle                      730
Côte-d'or                    706
...                          ...
Guadeloupe                    34
Réunion                       24
Guyane                        22
Mayotte                       17
Paris                          1

[90 rows x 1 columns]

In [100]:
# 7. Obtenir la liste des 10 plus grands départements, en terme de superficie
df_departements_nb_communes = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="inner") \
    .groupby("departement_nom") \
    .agg(surface=("ville_surface", "sum")) \
    .sort_values("surface", ascending=False)

df_departements_nb_communes

                    surface
departement_nom
Guyane             83531.00
Gironde             9975.59
Landes              9242.60
Dordogne            9060.01
Côte-d'or           8763.21
...                     ...
Mayotte              338.60
Val-de-Marne         245.03
Seine-Saint-Denis    236.20
Hauts-de-Seine       175.61
Paris                105.40

[90 rows x 1 columns]

In [128]:
# 8. Comptez le nombre de villes dont le nom commence par "Saint".
df_villes_saint = df_villes[df_villes["ville_nom"].str.upper().str.startswith("SAINT")]
len(df_villes_saint)

4260

In [132]:
# 9. Obtenez la liste des villes qui ont un nom existants plusieurs fois
df_villes.groupby("ville_nom") \
    .agg(nombre_ville=("ville_nom", "count")) \
    .sort_values("nombre_ville", ascending=False)

                nombre_ville
ville_nom
SAINTE-COLOMBE            14
SAINT-SAUVEUR             12
BEAULIEU                  11
SAINTE-MARIE              11
SAINT-AUBIN               10
...                      ...
GIZEUX                     1
GIZAY                      1
GIZAUCOURT                 1
GIVRYCOURT                 1
ZUYTPEENE                  1

[34084 rows x 1 columns]

In [139]:
# 10. Obtenir en une seule requête SQL la liste des villes dont la superficie est supérieure à la superficie moyenne.
moyenne_surface = df_villes["ville_surface"].mean()
df_villes_grande_superficie = df_villes[df_villes["ville_surface"] > moyenne_surface]
df_villes_grande_superficie

,ville_id,ville_departement,ville_nom,ville_nom_simple,ville_nom_reel,ville_code_postal,ville_commune,ville_code_commune,ville_population_2010,ville_population_1999,ville_population_2012,ville_surface,ville_longitude_deg,ville_latitude_deg,ville_longitude_dms,ville_latitude_dms,ville_zmin,ville_zmax
8,9,1,PERON,peron,Péron,1630,288,1288,2143,1578,1900,26.01,5.93333,46.20000,55535.0,461124.0,411.0,1501.0
20,21,1,NEUVILLE-LES-DAMES,neuville les dames,Neuville-les-Dames,1400,272,1272,1504,1232,1500,26.59,5.00000,46.16670,50013.0,460944.0,210.0,271.0
22,23,1,HOTONNES,hotonnes,Hotonnes,1260,187,1187,306,295,300,28.40,5.68333,46.00000,54136.0,455952.0,636.0,1338.0
24,25,1,SONGIEU,songieu,Songieu,1260,409,1409,130,123,100,20.58,5.70000,45.96670,54208.0,455824.0,567.0,1275.0
28,29,1,CHAZEY-SUR-AIN,chazey sur ain,Chazey-sur-Ain,1150,99,1099,1464,1200,1400,21.95,5.25000,45.90000,51516.0,455333.0,202.0,261.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36693,36823,976,OUANGANI,ouangani,Ouangani,97670,614,97614,9834,9834,9834,19.05,45.13790,-12.84780,NaN,NaN,NaN,NaN
36696,36826,976,TSINGONI,tsingoni,Tsingoni,97680,617,97617,10454,10454,10454,34.76,45.10700,-12.78970,NaN,NaN,NaN,NaN
36697,36827,971,SAINT BARTHELEMY,st barthelemy,Saint-Barthélemy,97133,123,97123,8938,8938,8938,24.00,-62.83330,17.91670,NaN,NaN,NaN,NaN
36698,36828,971,SAINT MARTIN,st martin,Saint-Martin,97150,127,97127,36979,36979,36979,53.20,18.09130,-63.08290,NaN,NaN,NaN,NaN
36699,36830,975,SAINT PIERRE ET MIQUELON,st pierre et miquelon,Saint-Pierre-et-Miquelon,97500,501,97501,6080,6080,6080,242.00,46.71070,1.71819,NaN,NaN,NaN,NaN

In [141]:
df_villes_grande_superficie["ville_nom"].head(10).to_list()

['PERON',
 'NEUVILLE-LES-DAMES',
 'HOTONNES',
 'SONGIEU',
 'CHAZEY-SUR-AIN',
 'CULOZ',
 'MARBOZ',
 'FOISSIAT',
 'TREFFORT-CUISIAT',
 'SAINT-ETIENNE-DU-BOIS']

In [145]:
# 11. Obtenez la liste des départements qui possèdent plus de 2 millions d’habitants
df_departements_somme_habitants = df_villes.merge(df_departements, left_on="ville_departement", right_on="departement_code", how="inner") \
    .groupby("departement_nom") \
    .agg(somme_habitants=("ville_population_2012", "sum"))

df_departements_somme_habitants

                  somme_habitants
departement_nom
Aube                       301500
Aude                       348900
Aveyron                    275200
Bas-Rhin                  1091000
Bouches-du-Rhône          1965400
...                           ...
Vendée                     616800
Vienne                     424100
Vosges                     381500
Yonne                      343300
Yvelines                  1406200

[90 rows x 1 columns]

In [147]:
df_departements_2m_habitants = df_departements_somme_habitants[df_departements_somme_habitants["somme_habitants"] > 2_000_000]
df_departements_2m_habitants

                 somme_habitants
departement_nom
Nord                     2565600
Paris                    2211000

In [150]:
df_departements_2m_habitants.index.to_list()

['Nord', 'Paris']